/*Створюємо базу даних librarydb*/
CREATE DATABASE librarydb;	

/*Вказуємо яку базу використовувати*/
USE librarydb;	

/*створюємо таблицю з книгами book з універсальними ключами*/
CREATE TABLE book	
(
	number int NOT NULL,
    cod    int NOT NULL PRIMARY KEY,
    new	   boolean,
    name   varchar(255) NOT NULL,
    price float DEFAULT =<25> NOT NULL,
    producer varchar(20) NOT NULL,
    sides int NOT NULL,
    form  varchar(255) NOT NULL,
    datee date NOT NULL,
    circulation int NOT NULL,
    topic varchar(255) NOT NULL,
    category varchar(255) NOT NULL
);

INSERT INTO book(number,cod,new,name,price,producer,sides,form,datee,circulation,topic,category) /*вставляємо нові поля в таблицю book*/
/*записуємо значення строчок*/
VALUES  (2,5111,0,'Апаратні засоби мультимедіа. Відеосистема РС',15.51,'Видавнича група BHV',400,'70х100/16','2000-07-24',5000,'Використання ПК в цілому','Підручники'),
		(8,4985,0,'Засвой самостійно модернізацію та ремонт ПК за 24 години, 2-ге вид.',18.90,'Вільямс',288,'70х100/16','2000-07-07',5000,'Використання ПК в цілому','Підручники'),
        (9,5141,0,'Структури даних та алгоритми',37.80,'Вільямс',384,'70х100/16','2000-09-29',5000,'Використання ПК в цілому','Підручники'),
        (20,5127,1,'Автоматизація інженерно-графічних робіт',11.58,'Видавнича група BHV',256,'70х100/16','2000-06-15',5000,'Використання ПК в цілому','Підручники'),
        (31,5110,0,'Апаратні засоби мультимедіа. Відеосистема РС',15.51,'Видавнича група BHV',400,'70х100/16','2000-07-24',5000,'Використання ПК в цілому','Апаратні засоби ПК'),
        (46,5199,0,'Залізо IBM 2001. ',30.07,'МикроАрт',368,'70х100/16','2000-12-02',5000,'Використання ПК в цілому','Апаратні засоби ПК'),
        (50,3851,1,'Захист інформації та безпека компютерних систем',26.00,'DiaSoft',480,'84х108/16','1999-02-04',5000,'Використання ПК в цілому','Захист і безпека ПК'),
        (58,3932,0,'Як перетворити персональний компютерна вимірювальний комплекс',7.65,'ДМК',144,'60х88/16','1999-06-09',5000,'Використання ПК в цілому','Інші книги'),
        (59,4713,0,'Plug-ins. Додаткові програми для музичних програм',11.41,'ДМК',144,'70х100/16','2000-02-22',5000,'Використання ПК в цілому','Інші книги'),
        (175,5217,0, 'Windows МЕ.  Найновіші версії програм',16.57,'Триумф',320,'70х100/16','2000-08-25',5000,'Операційні системи','Windows 2000'),
        (176,4829,0,'Windows 2000 Professional крок за кроком з СD',27.25,'Эком',320,'70х100/16','2000-04-28',5000,'Операційні системи','Windows 2000'),
        (188,5170,0,'Linux версії',24.43,'ДМК',346,'70х100/16','2000-09-29',5000,'Операційні системи','Linux'),
        (191,860,0,'Операційна система UNIX',3.50,'Видавнича група BHV',395,'84х100\16','1997-05-05',5000,'Операційні системи','Unix'),
        (203,44,0,'Відповіді на актуальні запитання щодо OS/2 Warp',5.00,'DiaSoft',352,'60х84/16','1996-03-20',5000,'Видавнича група BHV','Інші операційні системи'),
        (206,5176,0,'Windows Ме. Супутник користувача ',12.79,'Видавнича група BHV',306,'-','2000-10-10',5000,'Операційні системи','Інші операційні системи' ),
        (209,5462,0,'Мова програмування С++. Лекції та вправи',29.00,'DiaSoft',656,'84х108/16','2000-12-12',5000,'Програмування','C&C++'),
        (210,4982,0,'Язык программирования С. Лекции и упражнения',29.00,'DiaSoft',432,'84х108/16','2000-07-12',5000,'Програмування','C&C++'),
        (220,4687,0,'Ефективне використання C++ .50 рекомендацій щодо покращення ваших програм та проектів',17.60,'ДМК',240,'70х100/16','2000-02-03',5000,'Програмування','C&C++'),
        (222,235,0,'Інформаційні системи і структури даних',17.60,'ДМК',240,'70x100/16','2000-03-02',5000,'Програмування','C&C++');




/*Додавання в таблицю нового текстового поля "Автор", розміром 15 символів*/
ALTER TABLE book add Autor varchar(15); 

/*Збільшення розміру текстового поля "Автор" до 20 символів*/
ALTER TABLE book MODIFY COLUMN Autor varchar(25); 

/*Видалення текстового поля "Автор" з таблиці*/
ALTER TABLE book DROP COLUMN Autor; 

/*створюємо унікальний індекс book_marks в таблиці book*/
CREATE UNIQUE INDEX book_marks ON book (number); 

/*Зміна порядку сортування індексу і призначення його унікальності*/
SELECT * FROM book ORDER BY number DESC;	
DROP INDEX book_marks ON book;	/*Видалення індексу*/